In [5]:
import pymysql
import pandas as pd
import glob 
import pandas as pd
import os
con =pymysql.connect(host='ip', user='id', password='pw', db='db', charset='utf8')
cur = con.cursor()

In [6]:
customers = pd.read_csv('./dacon_data/open/customers.csv')

In [8]:
customers.head(2)

,Customer_id,Customer_unique_id,Customer_zipcode_prefix,Customer_city,Customer_state
0,CUSTOMER_00000,CUSTOMER_Unique_00000,14409,franca,SP
1,CUSTOMER_00001,CUSTOMER_Unique_00001,9790,sao bernardo do campo,SP

In [16]:
from sqlalchemy import create_engine, MetaData, Table, Column, Integer, String, BigInteger, DateTime, Date,Float

In [10]:
import sqlalchemy
from urllib import parse
user = 'id'
password = 'pw'
host='ip'
port = port
database = 'db'
password = parse.quote_plus(password)
engine = sqlalchemy.create_engine(f"mysql://{user}:{password}@{host}:{port}/{database}")

In [11]:
metadata = MetaData()

In [12]:
Table("dacon_customers", metadata, 
      Column('Customer_id', String(100)),
      Column("Customer_unique_id", String(100)),
      Column("Customer_zipcode_prefix", Integer),
      Column("Customer_city", String(100)),
      Column("Customer_state", String(100))
     )

Table('dacon_customers', MetaData(), Column('Customer_id', String(length=100), table=<dacon_customers>), Column('Customer_unique_id', String(length=100), table=<dacon_customers>), Column('Customer_zipcode_prefix', Integer(), table=<dacon_customers>), Column('Customer_city', String(length=100), table=<dacon_customers>), Column('Customer_state', String(length=100), table=<dacon_customers>), schema=None)

In [13]:
metadata.create_all(engine)
customers.to_sql("dacon_customers", if_exists='append', con=engine, index=False)

87955

In [15]:
locations = pd.read_csv('./dacon_data/open/locations.csv')
locations.head(2)

,Geolocation_zipcode_prefix,Geolocation_lat,Geolocation_lng,Geolocation_city,Geolocation_state
0,1037,-23.545621,-46.639292,sao paulo,SP
1,1046,-23.546081,-46.644820,sao paulo,SP

In [17]:
metadata = MetaData()
Table("dacon_locations", metadata, 
      Column('Geolocation_zipcode_prefix', Integer),
      Column("Geolocation_lat", Float),
      Column("Geolocation_lng", Float),
      Column("Geolocation_city", String(100)),
      Column("Geolocation_state", String(100))
     )
metadata.create_all(engine)
locations.to_sql("dacon_locations", if_exists='append', con=engine, index=False)

1000163

In [19]:
order_items = pd.read_csv('./dacon_data/open/order_items.csv')
order_items.head(2)

,Order_id,Order_item_id,Product_id,Seller_id,Price,Freight_value
0,ORDER_75477,1,PRODUCT_23128,SELLER_0452,58.9,13.29
1,ORDER_63604,1,PRODUCT_24351,SELLER_0414,239.9,19.93

In [20]:
metadata = MetaData()
Table("dacon_order_items", metadata, 
      Column('Order_id', String(100)),
      Column("Order_item_id", Integer),
      Column("Product_id", String(100)),
      Column("Seller_id", String(100)),
      Column("Price", Float),
      Column("Freight_value", Float)
     )
metadata.create_all(engine)
order_items.to_sql("dacon_order_items", if_exists='append', con=engine, index=False)

100557

In [21]:
orders = pd.read_csv('./dacon_data/open/orders.csv')
orders.head(2)

,Order_id,Customer_id,Order_status,Order_purchase_timestamp,Order_delivered_carrier_date,Order_delivered_customer_date,Order_estimated_delivery_date
0,ORDER_00000,CUSTOMER_62232,delivered,2018-10-02 10:56:33,2018-10-04 19:55:00,2018-10-10 21:25:13,2018-10-18
1,ORDER_00001,CUSTOMER_54059,delivered,2018-11-18 19:28:06,2018-11-22 13:39:59,2018-12-02 00:28:42,2018-12-15

In [22]:
metadata = MetaData()
Table("dacon_orders", metadata, 
      Column('Order_id', String(100)),
      Column("Customer_id", String(100)),
      Column("Order_status", String(100)),
      Column("Order_purchase_timestamp", String(100)),
      Column("Order_delivered_carrier_date", String(100)),
      Column("Order_delivered_customer_date", String(100)),
      Column("Order_estimated_delivery_date", String(100)),
     )
metadata.create_all(engine)
orders.to_sql("dacon_orders", if_exists='append', con=engine, index=False)

87955

In [23]:
payments = pd.read_csv('./dacon_data/open/payments.csv')
payments.head(2)

,Order_id,Payment_sequential,Payment_type,Payment_installments,Payment_value
0,ORDER_66617,1,credit_card,8,99.33
1,ORDER_86954,1,credit_card,1,24.39

In [24]:
metadata = MetaData()
Table("dacon_payments", metadata, 
      Column('Order_id', String(100)),
      Column("Payment_sequential", Integer),
      Column("Payment_type", String(100)),
      Column("Payment_installments", Integer),
      Column("Payment_value", Float)
     )
metadata.create_all(engine)
payments.to_sql("dacon_payments", if_exists='append', con=engine, index=False)

91971

In [40]:
products = pd.read_csv('./dacon_data/open/products.csv')
products.head(2)

,Product_id,Product_category_name,Product_weight_g,Product_length_cm,Product_height_cm,Product_width_cm
0,PRODUCT_00000,perfumery,225.0,16.0,10.0,14.0
1,PRODUCT_00001,arts,1000.0,30.0,18.0,20.0

In [52]:
products

,Product_id,Product_category_name,Product_weight_g,Product_length_cm,Product_height_cm,Product_width_cm
0,PRODUCT_00000,perfumery,225.0,16.0,10.0,14.0
1,PRODUCT_00001,arts,1000.0,30.0,18.0,20.0
2,PRODUCT_00002,sports_leisure,154.0,18.0,9.0,15.0
3,PRODUCT_00003,home_utilities,625.0,20.0,17.0,13.0
4,PRODUCT_00004,musical_instruments,200.0,38.0,5.0,11.0
...,...,...,...,...,...,...
29466,PRODUCT_29466,furniture_decor,12300.0,40.0,40.0,40.0
29467,PRODUCT_29467,construction_tools_lighting,1700.0,16.0,19.0,16.0
29468,PRODUCT_29468,bed_bath_table,1400.0,27.0,7.0,27.0
29469,PRODUCT_29469,computers_accessories,700.0,31.0,13.0,20.0
29470,PRODUCT_29470,bed_bath_table,2083.0,12.0,2.0,7.0

In [53]:
# products.Product_category_name.unique()

In [54]:
products.loc[7429]

Product_id                        PRODUCT_07429
Product_category_name    books_general_interest
Product_weight_g                         1200.0
Product_length_cm                          15.0
Product_height_cm                          15.0
Product_width_cm                           19.0
Name: 7429, dtype: object

In [29]:
# type(products.Product_weight_g)

pandas.core.series.Series

In [57]:
metadata = MetaData()
Table("dacon_products", metadata, 
      Column('Product_id', String(200)),
      Column("Product_category_name", String(200)),
      Column("Product_weight_g", String(200)),
      Column("Product_length_cm", String(200)),
      Column("Product_height_cm", String(200)),
      Column("Product_width_cm", String(200))
     )
# metadata.create_all(engine)
# products.to_sql("dacon_products", if_exists='append', con=engine, index=False)

Table('dacon_products', MetaData(), Column('Product_id', String(length=200), table=<dacon_products>), Column('Product_category_name', String(length=200), table=<dacon_products>), Column('Product_weight_g', String(length=200), table=<dacon_products>), Column('Product_length_cm', String(length=200), table=<dacon_products>), Column('Product_height_cm', String(length=200), table=<dacon_products>), Column('Product_width_cm', String(length=200), table=<dacon_products>), schema=None)

In [58]:
metadata.create_all(engine)

In [59]:
products.to_sql("dacon_products", if_exists='append', con=engine, index=False)

29471

In [60]:

reviews = pd.read_csv('./dacon_data/open/reviews.csv')
reviews.head(2)

,Review_id,Order_id,Review_score,Review_creation_date,Review_answer_timestamp
0,REVIEW_00000,ORDER_01674,4,2019-01-18 00:00:00,2019-01-18 21:46:59
1,REVIEW_00001,ORDER_80140,5,2019-03-10 00:00:00,2019-03-11 03:05:13

In [61]:
metadata = MetaData()
Table("dacon_reviews", metadata, 
      Column('Review_id', String(200)),
      Column("Order_id", String(200)),
      Column("Review_score", Integer),
      Column("Review_creation_date", String(200)),
      Column("Review_answer_timestamp", String(200))
     )
metadata.create_all(engine)
reviews.to_sql("dacon_reviews", if_exists='append', con=engine, index=False)

87873

In [62]:

sellers = pd.read_csv('./dacon_data/open/sellers.csv')
sellers.head(2)

     Seller_id  Seller_zipcode_prefix Seller_city Seller_state
0  SELLER_0000                  13023    campinas           SP
1  SELLER_0001                  13844  mogi guacu           SP

In [64]:
metadata = MetaData()
Table("dacon_sellers", metadata, 
      Column('Seller_id', String(200)),
      Column("Seller_zipcode_prefix", Integer),
      Column("Seller_city", String(100)),
      Column("Seller_state", String(100))
     )
metadata.create_all(engine)
sellers.to_sql("dacon_sellers", if_exists='append', con=engine, index=False)

2763